"""
Задание: на вход в метод HorseTurns подаются координаты коня на шахматной доске в виде строки, например 'c6'
Необходимо показать все возможные ходы коня на шахматной доске символом +, все остальные клетки заполнить символом -.
Клетку с конем показать символом К (латиница).

Координаты доски отсчитываются слева направо сверху вниз и отсчитываются от 'a1'.
"""

def HorseTurns(coords):
    
    plate = [] # Use generator for creating matrix of chessplate
    
    # Input your code here
    
    return plate # You have to return chessplate
