"""
Задание:
Функция FirstMaximum принимает на вход двумерный массив размером n*m (n - число строк, m - число столбцов, оба занчения заранее неизвестны).
Необходимо найти наибольший элемент во всем двумерном массиве и вернуть список его координат в двумерном массиве.
Если таких элементов несколько - вернуть самое раннее его нахождение.
Все значения внутри массива лежат в промежутке (-52, 51) и не являются вещественными.

Лимит времени работы программы: 64 мс
"""


def FirstMaximum(array):
    """
    Input your code here
    """
